In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'int_col' : [1,2,6,8,-1], 'float_col' : [0.1, 0.2,0.2,10.1,None], 'str_col' : ['a','b',None,'c','a']})

In [3]:
df

   int_col  float_col str_col
0        1        0.1       a
1        2        0.2       b
2        6        0.2    None
3        8       10.1       c
4       -1        NaN       a

In [4]:
for i in [i for i in df['str_col'].unique()]:
    df[i]=df['str_col']==i

In [5]:
df

   int_col  float_col str_col      a      b    NaN      c
0        1        0.1       a   True  False  False  False
1        2        0.2       b  False   True  False  False
2        6        0.2    None  False  False  False  False
3        8       10.1       c  False  False  False   True
4       -1        NaN       a   True  False  False  False

In [6]:
df[df['int_col']>1]

   int_col  float_col str_col      a      b    NaN      c
1        2        0.2       b  False   True  False  False
2        6        0.2    None  False  False  False  False
3        8       10.1       c  False  False  False   True

In [7]:
df['int_col']+df['float_col']

0     1.1
1     2.2
2     6.2
3    18.1
4     NaN
dtype: float64

# .str usage

https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html

In [8]:
s2 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'])

In [11]:
s2.str.split('_', expand=True)

     0    1    2
0    a    b    c
1    c    d    e
2  NaN  NaN  NaN
3    f    g    h

In [12]:
s2.str.split('_', expand=True, n=1)

     0    1
0    a  b_c
1    c  d_e
2  NaN  NaN
3    f  g_h

In [17]:
s = pd.Series(['a', 'b', 'c', 'd'])
t = pd.Series(['a', 'b', np.nan, 'd'])

In [23]:
s

0    a
1    b
2    c
3    d
dtype: object

In [24]:
t

0      a
1      b
2    NaN
3      d
dtype: object

In [19]:
t.str.cat(sep=',')

'a,b,d'

In [20]:
t.str.cat(sep=',', na_rep='-')

'a,b,-,d'

In [28]:
s.str.cat(t, na_rep='-')

0    aa
1    bb
2    c-
3    dd
dtype: object